openhanko/openhanko-firmware/simple/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Descriptors are supplied from usb_descriptors.c, so the esp_tinyusb string
# options below only matter if that code is ever removed.
CONFIG_TINYUSB_DESC_USE_DEFAULT_PID=n
CONFIG_TINYUSB_DESC_CUSTOM_PID=0x4001
CONFIG_TINYUSB_DESC_MANUFACTURER_STRING="smart-card-poc"
CONFIG_TINYUSB_DESC_PRODUCT_STRING="smart-card-poc"
CONFIG_TINYUSB_DESC_SERIAL_STRING="SC-PROTOTYPE"
CONFIG_TINYUSB_HID_COUNT=1
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_COUNT=1
CONFIG_TINYUSB_CDC_RX_BUFSIZE=64
CONFIG_TINYUSB_CDC_TX_BUFSIZE=64
CONFIG_TINYUSB_CDC_EP_BUFSIZE=64

# At the 100 Hz default, pdMS_TO_TICKS() rounds every delay under 10 ms down to
# zero, which silently erases the pacing between HID key reports and the CDC
# write retry backoff. 1 kHz makes those delays mean what they say.
CONFIG_FREERTOS_HZ=1000

# ESP32-S3 shares one internal USB PHY between USB-Serial/JTAG and USB-OTG, so
# once TinyUSB claims it, anything logged over serial-JTAG is lost. Send the
# console to UART0 instead, which reaches the board's separate COM port and
# keeps working while the native USB port serves the smart card.
#
# On a board with no UART bridge (XIAO ESP32-S3), swap this for
# CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y and accept that logs stop once USB is up
# — tools/provision.py monitor is the diagnostic channel there.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# RFC 6979 deterministic ECDSA. Less critical here than on the RP2040 — this
# chip has a real entropy source once bootloader_random_enable() runs — but
# taking the RNG out of the signing path costs nothing and removes a whole class
# of failure.
CONFIG_MBEDTLS_ECDSA_DETERMINISTIC=y

